; domain
(define (domain maze)
    (:requirements :typing)

(:types
    tile - object
    teleport_group - object
    block_group - object
)
(:constants
    bgroup_colorless - block_group
    tgroup_unpaired - teleport_group
)


(:predicates
    (at ?x - tile) ;; the agent is at tile x
    (teleporter_at ?x - tile ?group - teleport_group) ;; there is a teleporter on tile x belonging to group
    (holding_item) ;; the agent is holding an item

    (adjacent ?x - tile ?y - tile) ;; tile x is adjacent to tile y
    (walkable ?x - tile) ;; tile x is walkable
    
    (block_at ?x - tile ?group - block_group) ;; there is a block on tile x belonging to group
    (block_target_at ?x - tile ?group - block_group) ;; there is a block target on tile x belonging to group
    (holding_block ?group - block_group) ;; the agent is holding a block belonging to group
    (item_at ?x - tile) ;; there is an item on tile x (i.e. you cannot place an item on this tile)

    (holding_tp ?group - teleport_group) ;; the agent is holding a teleporter belonging to group

    (color_remover_machine_at ?x - tile) ;; there is a color remover machine on tile x
    (color_assigner_machine_at ?x - tile ?group - block_group) ;; there is a color assigner machine on tile x belonging to group

    (teleport_unpairer_at ?x - tile) ;; there is a teleporter unpairer on tile x
    (teleport_pairer_at ?x - tile ?group - teleport_group) ;; there is a teleporter pairer on tile x belonging to group

    (gate_at ?x - tile ?group - block_group) ;; there is a gate on tile x belonging to group

)


(:action move
    ;; The agent moves from their current tile to an adjacent one
    :parameters (?x - tile ?y - tile)
    :precondition (and 
        (at ?x)
        (adjacent ?x ?y)
        (walkable ?y)
    )
    :effect (and
        (not (at ?x))
        (at ?y)
    )
)

(:action use_teleporter
    ;; The agent is standing at a tile that is a teleporter,
    ;; and teleport to another teleporter in the same group
    :parameters (
        ?current - tile
        ?target - tile
        ?group - teleport_group
    )
    :precondition (and
        (at ?current)
        (teleporter_at ?current ?group)
        (teleporter_at ?target ?group)
        (walkable ?target)
        (not (at ?target)) ;; This is so that the agent does not teleport to the tile they are in --
        ;; if this is not here, the agent may waste time trying to teleport to the same tile

        (not (teleporter_at ?current tgroup_unpaired)) ;; This is so that unpaired teleporters don't work.
    )
    :effect (and
        (not (at ?current))
        (at ?target)
    )
)

(:action pick_up_block
    ;; The agent is standing at a tile where there is a block,
    ;; and starts holding the block
    :parameters (
        ?x - tile
        ?block - block_group)
    :precondition (and
        (at ?x)
        (item_at ?x)
        (block_at ?x ?block)
        (not (holding_item))
    )
    :effect (and
        (not (block_at ?x ?block))
        (not (item_at ?x))
        (holding_block ?block)
        (holding_item)
    )
)

(:action drop_block
    ;; The agent is holding a block,
    ;; and drops the block at the current tile
    :parameters (
        ?x - tile
        ?block - block_group)
    :precondition (and
        (at ?x)
        (holding_block ?block)
        (holding_item)
        (not (item_at ?x))
        (not (block_at ?x ?block))
    )
    :effect (and
        (block_at ?x ?block)
        (item_at ?x)
        (not (holding_block ?block))
        (not (holding_item))
    )
)

(:action pick_up_tp
    ;; The agent is picking up a portal
    :parameters (
        ?x - tile
        ?group - teleport_group)
    :precondition (and
        (at ?x)
        (item_at ?x)
        (teleporter_at ?x ?group)
        (not (holding_item))
    )
    :effect (and
        (not (teleporter_at ?x ?group))
        (not (item_at ?x))
        (holding_item)
        (holding_tp ?group)

    )
)

(:action drop_tp
    ;; The agent is dropping a held portal
    :parameters (
        ?x - tile
        ?group - teleport_group
    )
    :precondition (and
        (at ?x)
        (not (item_at ?x))
        (holding_item)
        (holding_tp ?group)
    )
    :effect (and
        (teleporter_at ?x ?group)
        (item_at ?x)
        (not (holding_item))
        (not (holding_tp ?group))
    )
)

(:action use_color_remover_machine
    ;; The agent is standing at a tile that is a color remover machine,
    ;; and removes the color of the block they are holding
    :parameters (
        ?x - tile
        ?block - block_group
    )
    :precondition (and
        (at ?x)
        (holding_block ?block)
        (holding_item)
        (color_remover_machine_at ?x)
    )
    :effect (and
        (not (holding_block ?block))
        (holding_block bgroup_colorless)
    )
)

(:action use_color_assigner_machine
    ;; The agent is standing at a tile that is a color assigner machine,
    ;; and assigns the color of the block they are holding to the machine's color
    :parameters (
        ?x - tile
        ?block - block_group
    )
    :precondition (and
        (at ?x)
        (holding_block bgroup_colorless)
        (holding_item)
        (color_assigner_machine_at ?x ?block)
    )
    :effect (and
        (not (holding_block bgroup_colorless))
        (holding_block ?block)
    )
)

(:action unpair_tp
    ;; The agent is standing at a tile that is a teleporter unpairer,
    ;; and unpairs the teleporter they are holding
    :parameters (
        ?x - tile
        ?group - teleport_group
    )
    :precondition (and
        (at ?x)
        (holding_tp ?group)
        (holding_item)
        (teleport_unpairer_at ?x)
    )
    :effect (and
        (not (holding_tp ?group))
        (holding_tp tgroup_unpaired)
    )
)

(:action pair_tp
    ;; The agent is standing at a tile that is a teleporter pairer,
    ;; and pairs the teleporter they are holding to the pairer's teleporter group
    :parameters (
        ?x - tile
        ?group - teleport_group
    )
    :precondition (and
        (at ?x)
        (holding_tp tgroup_unpaired)
        (holding_item)
        (teleport_pairer_at ?x ?group)
    )
    :effect (and
        (not (holding_tp tgroup_unpaired))
        (holding_tp ?group)
    )
)

(:action unlock_gate
    ;; The agent is standing on a tile adjacent to a gate,
    ;; and is holding a block of the same color as the gate,
    ;; and unlocks the gate, destroying the block,
    ;; removing the gate, and making the gate tile walkable

    :parameters (
        ?x - tile
        ?y - tile
        ?bgroup - block_group
    )
    :precondition (and
        (at ?x)
        (adjacent ?x ?y)
        (gate_at ?y ?bgroup)
        (holding_block ?bgroup)
        (holding_item)
    )
    :effect (and
        (not (gate_at ?y ?bgroup))
        (not (holding_block ?bgroup))
        (not (holding_item))
        (walkable ?y)
    )
)
)

; problem
(define (problem simple_maze) (:domain maze)
(:objects 
  t0_0 - tile
  t1_0 - tile
  t2_0 - tile
  t3_0 - tile
  t4_0 - tile
  t5_0 - tile
  t6_0 - tile
  t0_1 - tile
  t1_1 - tile
  t2_1 - tile
  t3_1 - tile
  t4_1 - tile
  t5_1 - tile
  t6_1 - tile
  t0_2 - tile
  t1_2 - tile
  t2_2 - tile
  t3_2 - tile
  t4_2 - tile
  t5_2 - tile
  t6_2 - tile
  t0_3 - tile
  t1_3 - tile
  t2_3 - tile
  t3_3 - tile
  t4_3 - tile
  t5_3 - tile
  t6_3 - tile
  t0_4 - tile
  t1_4 - tile
  t2_4 - tile
  t3_4 - tile
  t4_4 - tile
  t5_4 - tile
  t6_4 - tile
  t0_5 - tile
  t1_5 - tile
  t2_5 - tile
  t3_5 - tile
  t4_5 - tile
  t5_5 - tile
  t6_5 - tile
  t0_6 - tile
  t1_6 - tile
  t2_6 - tile
  t3_6 - tile
  t4_6 - tile
  t5_6 - tile
  t6_6 - tile
  t0_7 - tile
  t1_7 - tile
  t2_7 - tile
  t3_7 - tile
  t4_7 - tile
  t5_7 - tile
  t6_7 - tile
 tgroup_g - teleport_group
 tgroup_useless - teleport_group
 tgroup_p - teleport_group
 bgroup_l - block_group
 bgroup_pp - block_group
 bgroup_bb - block_group
 bgroup_yy - block_group
 bgroup_g - block_group
 bgroup_k - block_group
)

(:init
  (adjacent t0_0 t0_1)
  (adjacent t0_0 t1_0)
  (walkable t0_0)
  (adjacent t1_0 t1_1)
  (adjacent t1_0 t0_0)
  (adjacent t1_0 t2_0)
  (walkable t1_0)
  (adjacent t2_0 t2_1)
  (adjacent t2_0 t1_0)
  (adjacent t2_0 t3_0)
  (walkable t2_0)
  (adjacent t3_0 t3_1)
  (adjacent t3_0 t2_0)
  (adjacent t3_0 t4_0)
  (walkable t3_0)
  (adjacent t4_0 t4_1)
  (adjacent t4_0 t3_0)
  (adjacent t4_0 t5_0)
  (walkable t4_0)
  (adjacent t5_0 t5_1)
  (adjacent t5_0 t4_0)
  (adjacent t5_0 t6_0)
  (walkable t5_0)
  (adjacent t6_0 t6_1)
  (adjacent t6_0 t5_0)
  (walkable t6_0)
  (at t6_0)  ;; This is the tile that the agent starts on
  (adjacent t0_1 t0_0)
  (adjacent t0_1 t0_2)
  (adjacent t0_1 t1_1)
  (walkable t0_1)
  (teleporter_at t0_1 tgroup_useless)
  (item_at t0_1)
  (adjacent t1_1 t1_0)
  (adjacent t1_1 t1_2)
  (adjacent t1_1 t0_1)
  (adjacent t1_1 t2_1)
  (walkable t1_1)
  (adjacent t2_1 t2_0)
  (adjacent t2_1 t2_2)
  (adjacent t2_1 t1_1)
  (adjacent t2_1 t3_1)
  (walkable t2_1)
  (adjacent t3_1 t3_0)
  (adjacent t3_1 t3_2)
  (adjacent t3_1 t2_1)
  (adjacent t3_1 t4_1)
  (walkable t3_1)
  (adjacent t4_1 t4_0)
  (adjacent t4_1 t4_2)
  (adjacent t4_1 t3_1)
  (adjacent t4_1 t5_1)
  (walkable t4_1)
  (adjacent t5_1 t5_0)
  (adjacent t5_1 t5_2)
  (adjacent t5_1 t4_1)
  (adjacent t5_1 t6_1)
  (walkable t5_1)
  (adjacent t6_1 t6_0)
  (adjacent t6_1 t6_2)
  (adjacent t6_1 t5_1)
  (walkable t6_1)
  (adjacent t0_2 t0_1)
  (adjacent t0_2 t0_3)
  (adjacent t0_2 t1_2)
  (walkable t0_2)
  (adjacent t1_2 t1_1)
  (adjacent t1_2 t1_3)
  (adjacent t1_2 t0_2)
  (adjacent t1_2 t2_2)
  (walkable t1_2)
  (adjacent t2_2 t2_1)
  (adjacent t2_2 t2_3)
  (adjacent t2_2 t1_2)
  (adjacent t2_2 t3_2)
  (walkable t2_2)
  (teleport_pairer_at t2_2 tgroup_p)
  (item_at t2_2) ;; cannot place blocks on pairers
  (adjacent t3_2 t3_1)
  (adjacent t3_2 t3_3)
  (adjacent t3_2 t2_2)
  (adjacent t3_2 t4_2)
  (walkable t3_2)
  (teleport_unpairer_at t3_2)
  (item_at t3_2) ;; cannot place blocks on machines
  (adjacent t4_2 t4_1)
  (adjacent t4_2 t4_3)
  (adjacent t4_2 t3_2)
  (adjacent t4_2 t5_2)
  (walkable t4_2)
  (teleport_pairer_at t4_2 tgroup_g)
  (item_at t4_2) ;; cannot place blocks on pairers
  (adjacent t5_2 t5_1)
  (adjacent t5_2 t5_3)
  (adjacent t5_2 t4_2)
  (adjacent t5_2 t6_2)
  (walkable t5_2)
  (adjacent t6_2 t6_1)
  (adjacent t6_2 t6_3)
  (adjacent t6_2 t5_2)
  (walkable t6_2)
  (adjacent t0_4 t0_3)
  (adjacent t0_4 t0_5)
  (adjacent t0_4 t1_4)
  (walkable t0_4)
  (block_at t0_4 bgroup_k)
  (item_at t0_4)
  (adjacent t1_4 t1_3)
  (adjacent t1_4 t1_5)
  (adjacent t1_4 t0_4)
  (adjacent t1_4 t2_4)
  (walkable t1_4)
  (adjacent t2_4 t2_3)
  (adjacent t2_4 t2_5)
  (adjacent t2_4 t1_4)
  (adjacent t2_4 t3_4)
  (walkable t2_4)
  (adjacent t4_4 t4_3)
  (adjacent t4_4 t4_5)
  (adjacent t4_4 t3_4)
  (adjacent t4_4 t5_4)
  (walkable t4_4)
  (adjacent t5_4 t5_3)
  (adjacent t5_4 t5_5)
  (adjacent t5_4 t4_4)
  (adjacent t5_4 t6_4)
  (walkable t5_4)
  (adjacent t6_4 t6_3)
  (adjacent t6_4 t6_5)
  (adjacent t6_4 t5_4)
  (walkable t6_4)
  (block_at t6_4 bgroup_pp)
  (item_at t6_4)
  (adjacent t0_5 t0_4)
  (adjacent t0_5 t0_6)
  (adjacent t0_5 t1_5)
  (walkable t0_5)
  (block_at t0_5 bgroup_g)
  (item_at t0_5)
  (adjacent t1_5 t1_4)
  (adjacent t1_5 t1_6)
  (adjacent t1_5 t0_5)
  (adjacent t1_5 t2_5)
  (walkable t1_5)
  (adjacent t2_5 t2_4)
  (adjacent t2_5 t2_6)
  (adjacent t2_5 t1_5)
  (adjacent t2_5 t3_5)
  (walkable t2_5)
  (adjacent t4_5 t4_4)
  (adjacent t4_5 t4_6)
  (adjacent t4_5 t3_5)
  (adjacent t4_5 t5_5)
  (walkable t4_5)
  (adjacent t5_5 t5_4)
  (adjacent t5_5 t5_6)
  (adjacent t5_5 t4_5)
  (adjacent t5_5 t6_5)
  (walkable t5_5)
  (adjacent t6_5 t6_4)
  (adjacent t6_5 t6_6)
  (adjacent t6_5 t5_5)
  (walkable t6_5)
  (block_at t6_5 bgroup_yy)
  (item_at t6_5)
  (adjacent t0_6 t0_5)
  (adjacent t0_6 t0_7)
  (adjacent t0_6 t1_6)
  (walkable t0_6)
  (block_at t0_6 bgroup_colorless)
  (item_at t0_6)
  (adjacent t1_6 t1_5)
  (adjacent t1_6 t1_7)
  (adjacent t1_6 t0_6)
  (adjacent t1_6 t2_6)
  (walkable t1_6)
  (adjacent t2_6 t2_5)
  (adjacent t2_6 t2_7)
  (adjacent t2_6 t1_6)
  (adjacent t2_6 t3_6)
  (walkable t2_6)
  (adjacent t4_6 t4_5)
  (adjacent t4_6 t4_7)
  (adjacent t4_6 t3_6)
  (adjacent t4_6 t5_6)
  (walkable t4_6)
  (adjacent t5_6 t5_5)
  (adjacent t5_6 t5_7)
  (adjacent t5_6 t4_6)
  (adjacent t5_6 t6_6)
  (walkable t5_6)
  (adjacent t6_6 t6_5)
  (adjacent t6_6 t6_7)
  (adjacent t6_6 t5_6)
  (walkable t6_6)
  (block_at t6_6 bgroup_bb)
  (item_at t6_6)
  (adjacent t0_7 t0_6)
  (adjacent t0_7 t1_7)
  (walkable t0_7)
  (block_at t0_7 bgroup_l)
  (item_at t0_7)
  (adjacent t1_7 t1_6)
  (adjacent t1_7 t0_7)
  (adjacent t1_7 t2_7)
  (walkable t1_7)
  (adjacent t2_7 t2_6)
  (adjacent t2_7 t1_7)
  (adjacent t2_7 t3_7)
  (walkable t2_7)
  (teleporter_at t2_7 tgroup_p)
  (item_at t2_7)
  (adjacent t4_7 t4_6)
  (adjacent t4_7 t3_7)
  (adjacent t4_7 t5_7)
  (walkable t4_7)
  (teleporter_at t4_7 tgroup_g)
  (item_at t4_7)
  (adjacent t5_7 t5_6)
  (adjacent t5_7 t4_7)
  (adjacent t5_7 t6_7)
  (walkable t5_7)
  (adjacent t6_7 t6_6)
  (adjacent t6_7 t5_7)
  (walkable t6_7)
)

(:goal (and
  (block_at t1_0 bgroup_yy)
  (block_at t2_0 bgroup_colorless)
  (block_at t3_0 bgroup_l)
  (block_at t4_0 bgroup_k)
  (at t6_0)  ;; This is the tile that the agent should end on

))

)

; plan
1. (move t6_0 t5_0)
   deleted: (at t6_0)
   added: (at t5_0)
   goals met: 0 of 5
2. (move t5_0 t4_0)
   deleted: (at t5_0)
   added: (at t4_0)
   goals met: 0 of 5
3. (move t4_0 t3_0)
   deleted: (at t4_0)
   added: (at t3_0)
   goals met: 0 of 5
4. (move t3_0 t2_0)
   deleted: (at t3_0)
   added: (at t2_0)
   goals met: 0 of 5
5. (move t2_0 t1_0)
   deleted: (at t2_0)
   added: (at t1_0)
   goals met: 0 of 5
6. (move t1_0 t0_0)
   deleted: (at t1_0)
   added: (at t0_0)
   goals met: 0 of 5
7. (move t0_0 t0_1)
   deleted: (at t0_0)
   added: (at t0_1)
   goals met: 0 of 5
8. (pick_up_tp t0_1 tgroup_useless)
   deleted: (teleporter_at t0_1 tgroup_useless) (item_at t0_1)
   added: (holding_item) (holding_tp tgroup_useless)
   goals met: 0 of 5
9. (move t0_1 t0_0)
   deleted: (at t0_1)
   added: (at t0_0)
   goals met: 0 of 5
10. (move t0_0 t1_0)
   deleted: (at t0_0)
   added: (at t1_0)
   goals met: 0 of 5
11. (move t1_0 t2_0)
   deleted: (at t1_0)
   added: (at t2_0)
   goals met: 0 of 5
12. (move t2_0 t3_0)
   deleted: (at t2_0)
   added: (at t3_0)
   goals met: 0 of 5
13. (move t3_0 t3_1)
   deleted: (at t3_0)
   added: (at t3_1)
   goals met: 0 of 5
14. (move t3_1 t3_2)
   deleted: (at t3_1)
   added: (at t3_2)
   goals met: 0 of 5
15. (unpair_tp t3_2 tgroup_useless)
   deleted: (holding_tp tgroup_useless)
   added: (holding_tp tgroup_unpaired)
   goals met: 0 of 5
16. (move t3_2 t2_2)
   deleted: (at t3_2)
   added: (at t2_2)
   goals met: 0 of 5
17. (pair_tp t2_2 tgroup_p)
   deleted: (holding_tp tgroup_unpaired)
   added: (holding_tp tgroup_p)
   goals met: 0 of 5
18. (move t2_2 t2_1)
   deleted: (at t2_2)
   added: (at t2_1)
   goals met: 0 of 5
19. (move t2_1 t2_0)
   deleted: (at t2_1)
   added: (at t2_0)
   goals met: 0 of 5
20. (move t2_0 t3_0)
   deleted: (at t2_0)
   added: (at t3_0)
   goals met: 0 of 5
21. (drop_tp t3_0 tgroup_p)
   deleted: (holding_item) (holding_tp tgroup_p)
   added: (teleporter_at t3_0 tgroup_p) (item_at t3_0)
   goals met: 0 of 5
22. (use_teleporter t3_0 t2_7 tgroup_p)
   deleted: (at t3_0)
   added: (at t2_7)
   goals met: 0 of 5
23. (move t2_7 t1_7)
   deleted: (at t2_7)
   added: (at t1_7)
   goals met: 0 of 5
24. (move t1_7 t0_7)
   deleted: (at t1_7)
   added: (at t0_7)
   goals met: 0 of 5
25. (pick_up_block t0_7 bgroup_l)
   deleted: (block_at t0_7 bgroup_l) (item_at t0_7)
   added: (holding_block bgroup_l) (holding_item)
   goals met: 0 of 5
26. (move t0_7 t0_6)
   deleted: (at t0_7)
   added: (at t0_6)
   goals met: 0 of 5
27. (move t0_6 t1_6)
   deleted: (at t0_6)
   added: (at t1_6)
   goals met: 0 of 5
28. (drop_block t1_6 bgroup_l)
   deleted: (holding_block bgroup_l) (holding_item)
   added: (block_at t1_6 bgroup_l) (item_at t1_6)
   goals met: 0 of 5
29. (move t1_6 t0_6)
   deleted: (at t1_6)
   added: (at t0_6)
   goals met: 0 of 5
30. (pick_up_block t0_6 bgroup_colorless)
   deleted: (block_at t0_6 bgroup_colorless) (item_at t0_6)
   added: (holding_block bgroup_colorless) (holding_item)
   goals met: 0 of 5
31. (move t0_6 t1_6)
   deleted: (at t0_6)
   added: (at t1_6)
   goals met: 0 of 5
32. (move t1_6 t2_6)
   deleted: (at t1_6)
   added: (at t2_6)
   goals met: 0 of 5
33. (drop_block t2_6 bgroup_colorless)
   deleted: (holding_block bgroup_colorless) (holding_item)
   added: (block_at t2_6 bgroup_colorless) (item_at t2_6)
   goals met: 0 of 5
34. (move t2_6 t1_6)
   deleted: (at t2_6)
   added: (at t1_6)
   goals met: 0 of 5
35. (pick_up_block t1_6 bgroup_l)
   deleted: (block_at t1_6 bgroup_l) (item_at t1_6)
   added: (holding_block bgroup_l) (holding_item)
   goals met: 0 of 5
36. (move t1_6 t1_5)
   deleted: (at t1_6)
   added: (at t1_5)
   goals met: 0 of 5
37. (move t1_5 t1_4)
   deleted: (at t1_5)
   added: (at t1_4)
   goals met: 0 of 5
38. (drop_block t1_4 bgroup_l)
   deleted: (holding_block bgroup_l) (holding_item)
   added: (block_at t1_4 bgroup_l) (item_at t1_4)
   goals met: 0 of 5
39. (move t1_4 t0_4)
   deleted: (at t1_4)
   added: (at t0_4)
   goals met: 0 of 5
40. (pick_up_block t0_4 bgroup_k)
   deleted: (block_at t0_4 bgroup_k) (item_at t0_4)
   added: (holding_block bgroup_k) (holding_item)
   goals met: 0 of 5
41. (move t0_4 t1_4)
   deleted: (at t0_4)
   added: (at t1_4)
   goals met: 0 of 5
42. (move t1_4 t2_4)
   deleted: (at t1_4)
   added: (at t2_4)
   goals met: 0 of 5
43. (drop_block t2_4 bgroup_k)
   deleted: (holding_block bgroup_k) (holding_item)
   added: (block_at t2_4 bgroup_k) (item_at t2_4)
   goals met: 0 of 5
44. (move t2_4 t1_4)
   deleted: (at t2_4)
   added: (at t1_4)
   goals met: 0 of 5
45. (pick_up_block t1_4 bgroup_l)
   deleted: (block_at t1_4 bgroup_l) (item_at t1_4)
   added: (holding_block bgroup_l) (holding_item)
   goals met: 0 of 5
46. (move t1_4 t2_4)
   deleted: (at t1_4)
   added: (at t2_4)
   goals met: 0 of 5
47. (move t2_4 t2_5)
   deleted: (at t2_4)
   added: (at t2_5)
   goals met: 0 of 5
48. (drop_block t2_5 bgroup_l)
   deleted: (holding_block bgroup_l) (holding_item)
   added: (block_at t2_5 bgroup_l) (item_at t2_5)
   goals met: 0 of 5
49. (move t2_5 t2_4)
   deleted: (at t2_5)
   added: (at t2_4)
   goals met: 0 of 5
50. (pick_up_block t2_4 bgroup_k)
   deleted: (block_at t2_4 bgroup_k) (item_at t2_4)
   added: (holding_block bgroup_k) (holding_item)
   goals met: 0 of 5
51. (move t2_4 t2_5)
   deleted: (at t2_4)
   added: (at t2_5)
   goals met: 0 of 5
52. (move t2_5 t2_6)
   deleted: (at t2_5)
   added: (at t2_6)
   goals met: 0 of 5
53. (move t2_6 t2_7)
   deleted: (at t2_6)
   added: (at t2_7)
   goals met: 0 of 5
54. (use_teleporter t2_7 t3_0 tgroup_p)
   deleted: (at t2_7)
   added: (at t3_0)
   goals met: 0 of 5
55. (move t3_0 t4_0)
   deleted: (at t3_0)
   added: (at t4_0)
   goals met: 0 of 5
56. (drop_block t4_0 bgroup_k)
   deleted: (holding_block bgroup_k) (holding_item)
   added: (block_at t4_0 bgroup_k) (item_at t4_0)
   goals met: 1 of 5
57. (move t4_0 t3_0)
   deleted: (at t4_0)
   added: (at t3_0)
   goals met: 1 of 5
58. (use_teleporter t3_0 t2_7 tgroup_p)
   deleted: (at t3_0)
   added: (at t2_7)
   goals met: 1 of 5
59. (move t2_7 t2_6)
   deleted: (at t2_7)
   added: (at t2_6)
   goals met: 1 of 5
60. (move t2_6 t2_5)
   deleted: (at t2_6)
   added: (at t2_5)
   goals met: 1 of 5
61. (pick_up_block t2_5 bgroup_l)
   deleted: (block_at t2_5 bgroup_l) (item_at t2_5)
   added: (holding_block bgroup_l) (holding_item)
   goals met: 1 of 5
62. (move t2_5 t2_6)
   deleted: (at t2_5)
   added: (at t2_6)
   goals met: 1 of 5
63. (move t2_6 t2_7)
   deleted: (at t2_6)
   added: (at t2_7)
   goals met: 1 of 5
64. (use_teleporter t2_7 t3_0 tgroup_p)
   deleted: (at t2_7)
   added: (at t3_0)
   goals met: 1 of 5
65. (move t3_0 t2_0)
   deleted: (at t3_0)
   added: (at t2_0)
   goals met: 1 of 5
66. (drop_block t2_0 bgroup_l)
   deleted: (holding_block bgroup_l) (holding_item)
   added: (block_at t2_0 bgroup_l) (item_at t2_0)
   goals met: 1 of 5
67. (move t2_0 t3_0)
   deleted: (at t2_0)
   added: (at t3_0)
   goals met: 1 of 5
68. (use_teleporter t3_0 t2_7 tgroup_p)
   deleted: (at t3_0)
   added: (at t2_7)
   goals met: 1 of 5
69. (move t2_7 t2_6)
   deleted: (at t2_7)
   added: (at t2_6)
   goals met: 1 of 5
70. (pick_up_block t2_6 bgroup_colorless)
   deleted: (block_at t2_6 bgroup_colorless) (item_at t2_6)
   added: (holding_block bgroup_colorless) (holding_item)
   goals met: 1 of 5
71. (move t2_6 t2_7)
   deleted: (at t2_6)
   added: (at t2_7)
   goals met: 1 of 5
72. (use_teleporter t2_7 t3_0 tgroup_p)
   deleted: (at t2_7)
   added: (at t3_0)
   goals met: 1 of 5
73. (move t3_0 t2_0)
   deleted: (at t3_0)
   added: (at t2_0)
   goals met: 1 of 5
74. (move t2_0 t1_0)
   deleted: (at t2_0)
   added: (at t1_0)
   goals met: 1 of 5
75. (drop_block t1_0 bgroup_colorless)
   deleted: (holding_block bgroup_colorless) (holding_item)
   added: (block_at t1_0 bgroup_colorless) (item_at t1_0)
   goals met: 1 of 5
76. (move t1_0 t2_0)
   deleted: (at t1_0)
   added: (at t2_0)
   goals met: 1 of 5
77. (move t2_0 t3_0)
   deleted: (at t2_0)
   added: (at t3_0)
   goals met: 1 of 5
78. (pick_up_tp t3_0 tgroup_p)
   deleted: (teleporter_at t3_0 tgroup_p) (item_at t3_0)
   added: (holding_item) (holding_tp tgroup_p)
   goals met: 1 of 5
79. (move t3_0 t4_0)
   deleted: (at t3_0)
   added: (at t4_0)
   goals met: 1 of 5
80. (move t4_0 t5_0)
   deleted: (at t4_0)
   added: (at t5_0)
   goals met: 1 of 5
81. (drop_tp t5_0 tgroup_p)
   deleted: (holding_item) (holding_tp tgroup_p)
   added: (teleporter_at t5_0 tgroup_p) (item_at t5_0)
   goals met: 1 of 5
82. (move t5_0 t4_0)
   deleted: (at t5_0)
   added: (at t4_0)
   goals met: 1 of 5
83. (move t4_0 t3_0)
   deleted: (at t4_0)
   added: (at t3_0)
   goals met: 1 of 5
84. (move t3_0 t2_0)
   deleted: (at t3_0)
   added: (at t2_0)
   goals met: 1 of 5
85. (pick_up_block t2_0 bgroup_l)
   deleted: (block_at t2_0 bgroup_l) (item_at t2_0)
   added: (holding_block bgroup_l) (holding_item)
   goals met: 1 of 5
86. (move t2_0 t3_0)
   deleted: (at t2_0)
   added: (at t3_0)
   goals met: 1 of 5
87. (drop_block t3_0 bgroup_l)
   deleted: (holding_block bgroup_l) (holding_item)
   added: (block_at t3_0 bgroup_l) (item_at t3_0)
   goals met: 2 of 5
88. (move t3_0 t2_0)
   deleted: (at t3_0)
   added: (at t2_0)
   goals met: 2 of 5
89. (move t2_0 t1_0)
   deleted: (at t2_0)
   added: (at t1_0)
   goals met: 2 of 5
90. (pick_up_block t1_0 bgroup_colorless)
   deleted: (block_at t1_0 bgroup_colorless) (item_at t1_0)
   added: (holding_block bgroup_colorless) (holding_item)
   goals met: 2 of 5
91. (move t1_0 t2_0)
   deleted: (at t1_0)
   added: (at t2_0)
   goals met: 2 of 5
92. (drop_block t2_0 bgroup_colorless)
   deleted: (holding_block bgroup_colorless) (holding_item)
   added: (block_at t2_0 bgroup_colorless) (item_at t2_0)
   goals met: 3 of 5
93. (move t2_0 t3_0)
   deleted: (at t2_0)
   added: (at t3_0)
   goals met: 3 of 5
94. (move t3_0 t4_0)
   deleted: (at t3_0)
   added: (at t4_0)
   goals met: 3 of 5
95. (move t4_0 t5_0)
   deleted: (at t4_0)
   added: (at t5_0)
   goals met: 3 of 5
96. (pick_up_tp t5_0 tgroup_p)
   deleted: (teleporter_at t5_0 tgroup_p) (item_at t5_0)
   added: (holding_item) (holding_tp tgroup_p)
   goals met: 3 of 5
97. (move t5_0 t4_0)
   deleted: (at t5_0)
   added: (at t4_0)
   goals met: 3 of 5
98. (move t4_0 t4_1)
   deleted: (at t4_0)
   added: (at t4_1)
   goals met: 3 of 5
99. (move t4_1 t4_2)
   deleted: (at t4_1)
   added: (at t4_2)
   goals met: 3 of 5
100. (move t4_2 t3_2)
   deleted: (at t4_2)
   added: (at t3_2)
   goals met: 3 of 5
101. (unpair_tp t3_2 tgroup_p)
   deleted: (holding_tp tgroup_p)
   added: (holding_tp tgroup_unpaired)
   goals met: 3 of 5
102. (move t3_2 t4_2)
   deleted: (at t3_2)
   added: (at t4_2)
   goals met: 3 of 5
103. (pair_tp t4_2 tgroup_g)
   deleted: (holding_tp tgroup_unpaired)
   added: (holding_tp tgroup_g)
   goals met: 3 of 5
104. (move t4_2 t4_1)
   deleted: (at t4_2)
   added: (at t4_1)
   goals met: 3 of 5
105. (move t4_1 t4_0)
   deleted: (at t4_1)
   added: (at t4_0)
   goals met: 3 of 5
106. (move t4_0 t5_0)
   deleted: (at t4_0)
   added: (at t5_0)
   goals met: 3 of 5
107. (drop_tp t5_0 tgroup_g)
   deleted: (holding_item) (holding_tp tgroup_g)
   added: (teleporter_at t5_0 tgroup_g) (item_at t5_0)
   goals met: 3 of 5
108. (use_teleporter t5_0 t4_7 tgroup_g)
   deleted: (at t5_0)
   added: (at t4_7)
   goals met: 3 of 5
109. (move t4_7 t4_6)
   deleted: (at t4_7)
   added: (at t4_6)
   goals met: 3 of 5
110. (move t4_6 t4_5)
   deleted: (at t4_6)
   added: (at t4_5)
   goals met: 3 of 5
111. (move t4_5 t5_5)
   deleted: (at t4_5)
   added: (at t5_5)
   goals met: 3 of 5
112. (move t5_5 t6_5)
   deleted: (at t5_5)
   added: (at t6_5)
   goals met: 3 of 5
113. (pick_up_block t6_5 bgroup_yy)
   deleted: (block_at t6_5 bgroup_yy) (item_at t6_5)
   added: (holding_block bgroup_yy) (holding_item)
   goals met: 3 of 5
114. (move t6_5 t6_6)
   deleted: (at t6_5)
   added: (at t6_6)
   goals met: 3 of 5
115. (move t6_6 t6_7)
   deleted: (at t6_6)
   added: (at t6_7)
   goals met: 3 of 5
116. (move t6_7 t5_7)
   deleted: (at t6_7)
   added: (at t5_7)
   goals met: 3 of 5
117. (move t5_7 t4_7)
   deleted: (at t5_7)
   added: (at t4_7)
   goals met: 3 of 5
118. (use_teleporter t4_7 t5_0 tgroup_g)
   deleted: (at t4_7)
   added: (at t5_0)
   goals met: 3 of 5
119. (move t5_0 t4_0)
   deleted: (at t5_0)
   added: (at t4_0)
   goals met: 3 of 5
120. (move t4_0 t3_0)
   deleted: (at t4_0)
   added: (at t3_0)
   goals met: 3 of 5
121. (move t3_0 t2_0)
   deleted: (at t3_0)
   added: (at t2_0)
   goals met: 3 of 5
122. (move t2_0 t1_0)
   deleted: (at t2_0)
   added: (at t1_0)
   goals met: 3 of 5
123. (drop_block t1_0 bgroup_yy)
   deleted: (holding_block bgroup_yy) (holding_item)
   added: (block_at t1_0 bgroup_yy) (item_at t1_0)
   goals met: 4 of 5
124. (move t1_0 t2_0)
   deleted: (at t1_0)
   added: (at t2_0)
   goals met: 4 of 5
125. (move t2_0 t3_0)
   deleted: (at t2_0)
   added: (at t3_0)
   goals met: 4 of 5
126. (move t3_0 t4_0)
   deleted: (at t3_0)
   added: (at t4_0)
   goals met: 4 of 5
127. (move t4_0 t5_0)
   deleted: (at t4_0)
   added: (at t5_0)
   goals met: 4 of 5
128. (move t5_0 t6_0)
   deleted: (at t5_0)
   added: (at t6_0)
   goals met: 5 of 5
